wxzed/CH552toCH340/S_CDC/CDC.C
            }
            break;
        case UIS_TOKEN_SETUP | 0:                                               //SETUP事务
            len = USB_RX_LEN;
            if(len == (sizeof(USB_SETUP_REQ)))
            {
                SetupLen = UsbSetupBuf->wLengthL;
								RTS_DTR = UsbSetupBuf->wValueL;
                if(UsbSetupBuf->wLengthH || SetupLen > 0x7F )
                {
                    SetupLen = 0x7F;                                             // 限制总长度
                }
                len = 0;                                                         // 默认为成功并且上传0长度
                SetupReq = UsbSetupBuf->bRequest;							
                if ( ( UsbSetupBuf->bRequestType & USB_REQ_TYP_MASK ) != USB_REQ_TYP_STANDARD ){/*HID类命令*/
										switch( SetupReq )                                             
										{
												case 0xC0:                                                  
														pDescr = &DataBuf[num];
														len = 2;
														if(num<24){	
																num += 2;
														}else{
																num = 24;
														}											
														break;
												case 0x40:
														len = 9;   //保证状态阶段，这里只要比8大，且不等于0xff即可
														break;
												case 0xa4:
													  switch(RTS_DTR){
																case 0x9f://RTS->LOW, DTR->LOW
																	P1 &= ~0x10; //RTS LOW
																	P1 &= ~0x20; //DTR LOW
																  break;
																case 0xdf://RTS->HIGH,DTR->LOW
																	P1 |=  0x10; //RTS HIGH
																	P1 &= ~0x20; //DTR LOW
																  break;
																case 0xff://RTS->HIGH,DTR->HIGH
																	P1 |=  0x10; //RTS HIGH
																  P1 |=  0x20; //DTR HIGH
																  break;
																case 0xbf://RTS->LOW,DTR->HIGH
																	P1 &= ~0x10; //RTS LOW
																	P1 |=  0x20; //DTR HIGH
																  break;
																default:
																	break;
														}
												    break;
												case 0x9a://set baud
														baudFlag0 = UsbSetupBuf->wValueL;
														baudFlag1 = UsbSetupBuf->wValueH;
														if((baudFlag0 == 0x12) && (baudFlag1 == 0x13)){
																baud0 = UsbSetupBuf->wIndexL;
																baud1 = UsbSetupBuf->wIndexH;
																switch (baud0)
																{
																		case 0x80:
																		{
																				switch(baud1)
																				{
																						case 0x96://110=0x6e
																							 LineCoding[3] = 0x00;
																						   LineCoding[2] = 0x00;
																							 LineCoding[1] = 0x00;
																						   LineCoding[0] = 0x6E;
																							 break;
																						 case 0xd9://300=0x12c
																							 LineCoding[3] = 0x00;
																						   LineCoding[2] = 0x00;
																							 LineCoding[1] = 0x01;
																						   LineCoding[0] = 0x2c;
																							 break;
																						 default:
																							 break;
																				}
																		}
																				break;
																		case 0x81:
																		{
																				switch(baud1)
																				{
																						case 0x64://600=0x258
																							 LineCoding[3] = 0x00;
																						   LineCoding[2] = 0x00;
																							 LineCoding[1] = 0x02;
																						   LineCoding[0] = 0x58;
																							 break;
																						 case 0xb2://1200=0x4b0
																							 LineCoding[3] = 0x00;
																						   LineCoding[2] = 0x00;
																							 LineCoding[1] = 0x02;
																						   LineCoding[0] = 0xb0;
																							 break;
																						 case 0xd9://2400=0x960
																							 LineCoding[3] = 0x00;
																						   LineCoding[2] = 0x00;
																							 LineCoding[1] = 0x09;
																						   LineCoding[0] = 0x60;
																							 break;
																						 default:
																							 break;
																				}
																		}
																				break;
																		case 0x82:
																		{
																				switch(baud1)
																					{
																						 case 0x64://4800 = 0x12c0
																							 LineCoding[3] = 0x00;
																						   LineCoding[2] = 0x00;
																							 LineCoding[1] = 0x12;
																						   LineCoding[0] = 0xc0;
																							 break;
																						 case 0xb2://9600 = 0x2580
																							 LineCoding[3] = 0x00;
																						   LineCoding[2] = 0x00;
																							 LineCoding[1] = 0x25;
																						   LineCoding[0] = 0x80;
																							 break;
																						 case 0xcc://14400 = 0x3840
																							 LineCoding[3] = 0x00;
																						   LineCoding[2] = 0x00;
																							 LineCoding[1] = 0x38;
																						   LineCoding[0] = 0x40;
																						   break;
																						 case 0xd9://19200=0x4B00
																							 LineCoding[3] = 0x00;
																						   LineCoding[2] = 0x00;
																							 LineCoding[1] = 0x4b;
																						   LineCoding[0] = 0x00;
																							 break;
																						 default:
																							 break;
																					}
																		}
																				break;
																		case 0x83:
																		{
																				switch(baud1)
																				{
																						 case 0x64://38400 = 0x9600
																							 LineCoding[3] = 0x00;
																						   LineCoding[2] = 0x00;
																							 LineCoding[1] = 0x96;
																						   LineCoding[0] = 0x00;
																							 break;
																						 case 0x95://56000 = 0xDAC0
																							 LineCoding[3] = 0x00;
																						   LineCoding[2] = 0x00;
																							 LineCoding[1] = 0xDA;
																						   LineCoding[0] = 0xC0;
																							 break;
																						 case 0x98://57600 = 0xE100
																							 LineCoding[3] = 0x00;
																						   LineCoding[2] = 0x00;
																							 LineCoding[1] = 0xE1;
																						   LineCoding[0] = 0x00;
																						   break;
																						 case 0xcc://115200=0x1c200
																							 LineCoding[3] = 0x00;
																						   LineCoding[2] = 0x01;
																							 LineCoding[1] = 0xc2;
																						   LineCoding[0] = 0x00;
																							 break;
																						 case 0xd1://128000=0x1f400
																							 LineCoding[3] = 0x00;
																						   LineCoding[2] = 0x01;
																							 LineCoding[1] = 0xf4;
																						   LineCoding[0] = 0x00;
																							 break;
																						 case 0xe6://230400=0x38400
																							 LineCoding[3] = 0x00;
																						   LineCoding[2] = 0x03;
																							 LineCoding[1] = 0x84;
																						   LineCoding[0] = 0x00;
																							 break;
																						 case 0xe9://256000=0x3e800
																							 LineCoding[3] = 0x00;
																						   LineCoding[2] = 0x03;
																							 LineCoding[1] = 0xe8;
																						   LineCoding[0] = 0x00;
																							 break;
																						 case 0xf3://460800=0x70800
																							 LineCoding[3] = 0x00;
																						   LineCoding[2] = 0x07;
																							 LineCoding[1] = 0x08;
																						   LineCoding[0] = 0x00;
																							 break;
																						 case 0xf4://512000=0x7D000
																							 LineCoding[3] = 0x00;
																						   LineCoding[2] = 0x07;
																							 LineCoding[1] = 0xD0;
																						   LineCoding[0] = 0x00;
																							 break;
																						 case 0xf6://600000=0x927C0
																							 LineCoding[3] = 0x00;
																						   LineCoding[2] = 0x09;
																							 LineCoding[1] = 0x27;
																						   LineCoding[0] = 0xC0;
																						 case 0xf8://750000=0xB71B0
																							 LineCoding[3] = 0x00;
																						   LineCoding[2] = 0x0B;
																							 LineCoding[1] = 0x71;
																						   LineCoding[0] = 0xB0;
																							 break;
																						 default:
																							 break;
																				}
																			}
																				break;
																		case 0x87:
																		{
																				switch(baud1)
																				{
																						case 0xf3://921600 = 0xE1000 
																							 LineCoding[3] = 0x00;
																						   LineCoding[2] = 0x0E;
																							 LineCoding[1] = 0x10;
																						   LineCoding[0] = 0x00;
																							break;
																						default:
																							break;
																				}
																		}
																				break;
																			default:
																				break;
																}
																		Config_Uart1(LineCoding);
														}
													break;
												default:
														len = 0xFF;  				                                   /*命令不支持*/					
														break;
										}
										if ( SetupLen > len )
										{
												SetupLen = len;    //限制总长度
										}
										len = SetupLen >= THIS_ENDP0_SIZE ? THIS_ENDP0_SIZE : SetupLen;//本次传输长度
										memcpy(Ep0Buffer,pDescr,len);                            //加载上传数据
										SetupLen -= len;
										pDescr += len;
						
                }else                                                             //标准请求
                {
                    switch(SetupReq)                                             //请求码
                    {
                    case USB_GET_DESCRIPTOR:
                        switch(UsbSetupBuf->wValueH)
                        {
                        case 1:                                                  //设备描述符
                            pDescr = DevDesc;                                    //把设备描述符送到要发送的缓冲区
                            len = sizeof(DevDesc);
                            break;
                        case 2:                                                  //配置描述符
                            pDescr = CfgDesc;                                    //把设备描述符送到要发送的缓冲区
                            len = sizeof(CfgDesc);
                            break;
                        default:
                            len = 0xff;                                          //不支持的命令或者出错
                            break;
                        }
                        if ( SetupLen > len )
                        {
                            SetupLen = len;    //限制总长度
                        }
                        len = SetupLen >= THIS_ENDP0_SIZE ? THIS_ENDP0_SIZE : SetupLen;//本次传输长度
                        memcpy(Ep0Buffer,pDescr,len);                            //加载上传数据
                        SetupLen -= len;
                        pDescr += len;
                        break;
                    case USB_SET_ADDRESS:
                        SetupLen = UsbSetupBuf->wValueL;                         //暂存USB设备地址
                        break;
                    case USB_GET_CONFIGURATION:
                        Ep0Buffer[0] = UsbConfig;
                        if ( SetupLen >= 1 )
                        {
                            len = 1;
                        }
                        break;
                    case USB_SET_CONFIGURATION:
                        UsbConfig = UsbSetupBuf->wValueL;
                        break;
                    case 0x0A:
                        break;
                    case USB_CLEAR_FEATURE:                                      //Clear Feature
                        if ( ( UsbSetupBuf->bRequestType & USB_REQ_RECIP_MASK ) == USB_REQ_RECIP_ENDP )// 端点
                        {
                            switch( UsbSetupBuf->wIndexL )
                            {
                            case 0x82:
                                UEP2_CTRL = UEP2_CTRL & ~ ( bUEP_T_TOG | MASK_UEP_T_RES ) | UEP_T_RES_NAK;
                                break;
                            case 0x02:
                                UEP2_CTRL = UEP2_CTRL & ~ ( bUEP_R_TOG | MASK_UEP_R_RES ) | UEP_R_RES_ACK;
                                break;
                            case 0x81:
                                UEP1_CTRL = UEP1_CTRL & ~ ( bUEP_T_TOG | MASK_UEP_T_RES ) | UEP_T_RES_NAK;
                                break;
						
                            default:
                                len = 0xFF;                                       // 不支持的端点
                                break;
                            }
                        }
                        else
                        {
                            len = 0xFF;                                           // 不是端点不支持
                        }
                        break;
                    case USB_SET_FEATURE:                                         /* Set Feature */
                        if( ( UsbSetupBuf->bRequestType & 0x1F ) == 0x00 )        /* 设置设备 */
                        {
                            if( ( ( ( UINT16 )UsbSetupBuf->wValueH << 8 ) | UsbSetupBuf->wValueL ) == 0x01 )
                            {
                                if( CfgDesc[ 7 ] & 0x20 )
                                {
                                    /* 设置唤醒使能标志 */
                                }
                                else
                                {
                                    len = 0xFF;                                    /* 操作失败 */
                                }
                            }
                            else
                            {
                                len = 0xFF;                                        /* 操作失败 */
                            }
                        }
                        else if( ( UsbSetupBuf->bRequestType & 0x1F ) == 0x02 )    /* 设置端点 */
                        {
                            if( ( ( ( UINT16 )UsbSetupBuf->wValueH << 8 ) | UsbSetupBuf->wValueL ) == 0x00 )
                            {
                                switch( ( ( UINT16 )UsbSetupBuf->wIndexH << 8 ) | UsbSetupBuf->wIndexL )
                                {
                                case 0x82:
                                    UEP2_CTRL = UEP2_CTRL & (~bUEP_T_TOG) | UEP_T_RES_STALL;/* 设置端点2 IN STALL */
                                    break;
                                case 0x02:
                                    UEP2_CTRL = UEP2_CTRL & (~bUEP_R_TOG) | UEP_R_RES_STALL;/* 设置端点2 OUT Stall */
                                    break;
                                case 0x81:
                                    UEP1_CTRL = UEP1_CTRL & (~bUEP_T_TOG) | UEP_T_RES_STALL;/* 设置端点1 IN STALL */
                                    break;
                                default:
                                    len = 0xFF;                                     /* 操作失败 */
                                    break;
                                }
                            }
                            else
                            {
                                len = 0xFF;                                         /* 操作失败 */
                            }
                        }
                        else
                        {
                            len = 0xFF;                                             /* 操作失败 */
                        } 
                        break;
                    case USB_GET_STATUS:
                        Ep0Buffer[0] = 0x00;
                        Ep0Buffer[1] = 0x00;
                        if ( SetupLen >= 2 )
                        {
                            len = 2;
                        }
                        else
                        {
                            len = SetupLen;
                        }
                        break;
                    default:
                        len = 0xff;                                                  //操作失败
                        break;
                    }
                }
            }
            else
            {
                len = 0xff;                                                          //包长度错误
            }
            if(len == 0xff)
            {
                SetupReq = 0xFF;
                UEP0_CTRL = bUEP_R_TOG | bUEP_T_TOG | UEP_R_RES_STALL | UEP_T_RES_STALL;//STALL
            }
            else if(len <= THIS_ENDP0_SIZE)                                         //上传数据或者状态阶段返回0长度包
            {
                UEP0_T_LEN = len;
                UEP0_CTRL = bUEP_R_TOG | bUEP_T_TOG | UEP_R_RES_ACK | UEP_T_RES_ACK;//默认数据包是DATA1，返回应答ACK
            }
            else
            {
                UEP0_T_LEN = 0;  //虽然尚未到状态阶段，但是提前预置上传0长度数据包以防主机提前进入状态阶段
                UEP0_CTRL = bUEP_R_TOG | bUEP_T_TOG | UEP_R_RES_ACK | UEP_T_RES_ACK;//默认数据包是DATA1,返回应答ACK
            }
            break;
        case UIS_TOKEN_IN | 0:                                                      //endpoint0 IN
            switch(SetupReq)
            {
            case USB_GET_DESCRIPTOR:
                len = SetupLen >= THIS_ENDP0_SIZE ? THIS_ENDP0_SIZE : SetupLen;     //本次传输长度
                memcpy( Ep0Buffer, pDescr, len );                                   //加载上传数据
                SetupLen -= len;
                pDescr += len;
                UEP0_T_LEN = len;
                UEP0_CTRL ^= bUEP_T_TOG;                                            //同步标志位翻转
                break;
            case USB_SET_ADDRESS:
                USB_DEV_AD = USB_DEV_AD & bUDA_GP_BIT | SetupLen;
                UEP0_CTRL = UEP_R_RES_ACK | UEP_T_RES_NAK;
                break;
            default:
                UEP0_T_LEN = 0;                                                      //状态阶段完成中断或者是强制上传0长度数据包结束控制传输
                UEP0_CTRL = UEP_R_RES_ACK | UEP_T_RES_NAK;
                break;
            }
            break;
        case UIS_TOKEN_OUT | 0:  // endpoint0 OUT
            len = USB_RX_LEN;
            if(SetupReq == 0x09)
            {
                if(Ep0Buffer[0])
                {
                    printf("Light on Num Lock LED!\n");
                }
                else if(Ep0Buffer[0] == 0)
                {
                    printf("Light off Num Lock LED!\n");
                }
            }
            UEP0_T_LEN = 0;  //虽然尚未到状态阶段，但是提前预置上传0长度数据包以防主机提前进入状态阶段
            UEP0_CTRL = UEP_R_RES_ACK | UEP_T_RES_ACK;//默认数据包是DATA0,返回应答ACK
            break;
        default:
            break;
        }
        UIF_TRANSFER = 0;                                                           //写0清空中断
    }
    if(UIF_BUS_RST)                                                                 //设备模式USB总线复位中断
    {
        UEP0_CTRL = UEP_R_RES_ACK | UEP_T_RES_NAK;
        UEP1_CTRL = bUEP_AUTO_TOG | UEP_T_RES_NAK;
        UEP2_CTRL = bUEP_AUTO_TOG | UEP_T_RES_NAK | UEP_R_RES_ACK;
        USB_DEV_AD = 0x00;
        UIF_SUSPEND = 0;
        UIF_TRANSFER = 0;
        UIF_BUS_RST = 0;                                                             //清中断标志
		    Uart_Input_Point = 0;   //循环缓冲区输入指针
				Uart_Output_Point = 0;  //循环缓冲区读出指针
				UartByteCount = 0;      //当前缓冲区剩余待取字节数
				USBByteCount = 0;       //USB端点收到的长度
				UsbConfig = 0;          //清除配置值
				UpPoint2_Busy = 0;
    }
    if (UIF_SUSPEND)                                                                 //USB总线挂起/唤醒完成
    {
        UIF_SUSPEND = 0;
        if ( USB_MIS_ST & bUMS_SUSPEND )                                             //挂起
        {
#ifdef DE_PRINTF
            printf( "zz" );                                                          //睡眠状态
#endif
            while ( XBUS_AUX & bUART0_TX )
            {
                ;    //等待发送完成
            }
            SAFE_MOD = 0x55;
            SAFE_MOD = 0xAA;
            WAKE_CTRL = bWAK_BY_USB | bWAK_RXD0_LO | bWAK_RXD1_LO;                      //USB或者RXD0/1有信号时可被唤醒
            PCON |= PD;                                                                 //睡眠
            SAFE_MOD = 0x55;
            SAFE_MOD = 0xAA;
            WAKE_CTRL = 0x00;
        }
    }
    else {                                                                             //意外的中断,不可能发生的情况
        USB_INT_FG = 0xFF;                                                             //清中断标志
//      printf("UnknownInt  N");
    }
}
/*******************************************************************************
* Function Name  : Uart1_ISR()
* Description    : 串口接收中断函数，实现循环缓冲接收
*******************************************************************************/
void Uart1_ISR(void) interrupt INT_NO_UART1
{
	if(U1RI)   //收到数据
	{
		Receive_Uart_Buf[Uart_Input_Point++] = SBUF1;
		UartByteCount++;                    //当前缓冲区剩余待取字节数
		if(Uart_Input_Point>=UART_REV_LEN)
			Uart_Input_Point = 0;           //写入指针
		U1RI =0;		
	}
	
