wxzed/CH552toCH340/S_CDC/CDC.C
}
//主函数
main()
{
	UINT8 lenth;
	UINT8 j = 0;
	UINT8 Uart_Timeout = 0;
	UINT8 nowStatus = 0;
	//P3_DIR_PU=0xFF;
	P1_DIR_PU=0xFF;
	P1 &= ~0x10; //RTS LOW
	P1 &= ~0x20; //DTR LOW
	//P1 &= ~0x10; //RTS LOW
	//P1 |=  0x10; //RTS HIGH
	//P1 &= ~0x20; //DTR LOW
	//P1 |=  0x20; //DTR HIGH
	//p1.4RTS
	//p1.5DTR
    CfgFsys( );                                                           //CH559时钟选择配置
    mDelaymS(5);                                                          //修改主频等待内部晶振稳定,必加	
    mInitSTDIO( );                                                        //串口0,可以用于调试
	UART1Setup( );                                                        //用于CDC
#ifdef DE_PRINTF
    printf("start ...\n");
#endif	

    USBDeviceCfg();                                                    
    USBDeviceEndPointCfg();                                               //端点配置
    USBDeviceIntCfg();                                                    //中断初始化
	  UEP0_T_LEN = 0;
    UEP1_T_LEN = 0;                                                       //预使用发送长度一定要清空
    UEP2_T_LEN = 0;                                                       //预使用发送长度一定要清空

    while(1)
    {
		if(UsbConfig)
		{
			if(USBByteCount)   //USB接收端点有数据
			{
				CH554UART1SendByte(Ep2Buffer[USBBufOutPoint++]);
				USBByteCount--;
				if(USBByteCount==0) 
					UEP2_CTRL = UEP2_CTRL & ~ MASK_UEP_R_RES | UEP_R_RES_ACK;
			}
			if(UartByteCount)
				Uart_Timeout++;
			if(!UpPoint2_Busy)   //端点不繁忙（空闲后的第一包数据，只用作触发上传）
			{
				lenth = UartByteCount;
				if(lenth>0)
				{
					if(lenth>31 || Uart_Timeout>100)
					{		
						Uart_Timeout = 0;
						if(Uart_Output_Point+lenth>UART_REV_LEN)
							lenth = UART_REV_LEN-Uart_Output_Point;
						UartByteCount -= lenth;			
						//写上传端点
						memcpy(Ep2Buffer+MAX_PACKET_SIZE,&Receive_Uart_Buf[Uart_Output_Point],lenth);
						Uart_Output_Point+=lenth;
						if(Uart_Output_Point>=UART_REV_LEN)
							Uart_Output_Point = 0;						
						UEP2_T_LEN = lenth;                                                    //预使用发送长度一定要清空
						UEP2_CTRL = UEP2_CTRL & ~ MASK_UEP_T_RES | UEP_T_RES_ACK;            //应答ACK
						UpPoint2_Busy = 1;
					}
				}
			}
		}		
    }
}
